<?php

use Illuminate\Database\Seeder;
use App\Models\Setting;

class SettingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
         $setting = [
            [
                'id'             => 1,
                'site_name'           => 'رشد',
                'email'          => ' INFO@DOMAIN.COM',
                'phone'       =>'0533350181',
                'address' => 'SAUDI ARABIA , JEDDAH',
                'facebook'          => null,
                'twitter'      => null,
                'instagram'          => null,
                'you_tube'      => null,
                'about_rosd'=>'تأسس مركز رشد لمساعدة الأفراد على إيجاد حلول لمشكلاتهم ومساعدتهم في تجاوز ازماتهم النفسية وما يترتب عليها من مشاعر وسلوكيات وأفكار مزعجة، ومساعدتهم في تحسين علاقاتهم الشخصية واكسابهم المهارات الاجتماعية، ومساعدتهم على التعامل مع ضغوط الحياة لتحسين جودة حياتهم وتحقيق مستوى عالي من الرفاه والصحة النفسية ',
                'familly_advice'=>'غالبًا ما يكون لدى العائلات أنماط من التواصل أو التصرفات التي تؤدي إلى تكرار الصراع. في بعض الأحيان هناك صدمة أو أزمة - ربما سوء معاملة أو إدمان أو طلاق أو صعوبات مالية أو مشاكل سلوك الأطفال - والتي تدرك الأسرة من خلالها أنها ليست مجهزة للتعامل معها بمفردها.

                من خلال الاستشارة يمكنك استكشاف أدوار عائلتك وقواعدها وأنماط سلوكها. سوف تحدد المشاكل والقضايا التي تساهم في الصراع. سيساعد مستشارك في تحسين قدرة عائلتك على حل المشكلات والتواصل حتى تتمكن من التمتع ببيئة منزلية أكثر صحة ومحبة وداعمة.
                
                هناك أمل لعائلتك! احجز الآن لتحديد موعد مع مستشار سوف يتعرف على عائلتك ويساعدك على التحرك نحو حياة منزلية أكثر صحة تتميز بالحب والفرح.',
                'individual_advice'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'el_gadaly_elsloky'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'el_maarefe_elsloky'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'art_therapy'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'play_therapy'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'individual_advice'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'message'=>'سعى لأن نكون بصمة واضحة في تقديم الاستشارات النفسية و الإشرافیة بكفاءة و بمعايير مهنيه عالميه لرفع جودة الحياه في إطار متكامل و الاستثمار بمهارات الفرد و تنميتها لتحقيق أعلى مستوى من الرضا و الصحة النفسيه',
                'vision'=>'نطمح لأن نكون الاختيار الأول للباحثين عن الجودة والأمانة بمجال الاستشارات النفسية، كما نطمح لتطوير المهارات الاستشارية للممارسين بالمجال النفسي عبر الاضطلاع على كل ما هو جديد في هذا المجال. قيمنا نلتزم بالميثاق الأخلاقي والمعايير المهنية و احترام التنوع الثقافي لكافة الفئات.',
                'services'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                'why'=>'.هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',



            ],
        ];

        Setting::insert($setting);
    }
}
